In [8]:
import pandas as pd
data=pd.read_excel('Human resource (1).xlsx')
data

            Employee Name         Department  Salary  Age  Gender Date of Join
0      Wilson  K Adinolfi  Production          62506   49   Male    07-05-2011
1    Karthikeyan Ait Sidi              IT/IS  104437   55   Male    30-03-2015
2        Sarah Akinkuolie  Production          64955   49  Female   07-05-2011
3            Trina Alagbe  Production          64991   49  Female   01-07-2008
4          Carol Anderson  Production          50825   31  Female   07-11-2011
..                    ...                ...     ...  ...     ...          ...
306         Jason Woodson  Production          65893   39   Male    07-07-2014
307      Catherine Ybarra  Production          48513   35  Female   09-02-2008
308       Jennifer Zamora              IT/IS  220450   42  Female   04-10-2010
309            Julia Zhou              IT/IS   89292   42  Female   30-03-2015
310          Colleen Zima  Production          45046   58  Female   29-09-2014

[311 rows x 6 columns]

In [9]:
data.head()

          Employee Name         Department  Salary  Age  Gender Date of Join
0    Wilson  K Adinolfi  Production          62506   49   Male    07-05-2011
1  Karthikeyan Ait Sidi              IT/IS  104437   55   Male    30-03-2015
2      Sarah Akinkuolie  Production          64955   49  Female   07-05-2011
3          Trina Alagbe  Production          64991   49  Female   01-07-2008
4        Carol Anderson  Production          50825   31  Female   07-11-2011

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311 entries, 0 to 310
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Employee Name  311 non-null    object
 1   Department     311 non-null    object
 2   Salary         311 non-null    int64
 3   Age            311 non-null    int64
 4   Gender         311 non-null    object
 5   Date of Join   311 non-null    object
dtypes: int64(2), object(4)
memory usage: 14.7+ KB

# Find the Total Salary

In [11]:
data.sum()

Employee Name    Wilson  K AdinolfiKarthikeyan Ait SidiSarah Ak...
Department       Production       IT/ISProduction       Product...
Salary                                                    21465433
Age                                                          13071
Gender           Male Male FemaleFemaleFemaleFemaleFemaleMale F...
Date of Join     07-05-201130-03-201507-05-201101-07-200807-11-...
dtype: object

# Find the average salary given in the company

In [14]:
a=data['Salary'].mean()
a

69020.6848874598

# Find the Maximum salary

In [15]:
a=data['Salary'].max()
a

250000

# Find the minimum Salary

In [16]:
a=data['Salary'].min()
a

45046

# Find the range of salary

In [19]:
a=250000-45046
a

204954

# Find the descriptive Statistics for the variable Salary and identify the Varience

In [ ]:
#descriptive statistics
#measure of dispersion
#variance and std deviation

In [22]:
#variance
X=[1,2,3,4,5]

#using numpy
np.var(X)

NameError: name 'np' is not defined